src/Catalogs/КоллекцииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КоллекцииНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_ТехническийЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_ДатаНачалаФормированияЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_ДатаОкончанияФормированияЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_ДатаНачалаОтгрузкиЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_ДатаОкончанияОтгрузкиЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_ДатаОкончанияРедактированияСкидок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>гф_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/КоллекцииНоменклатуры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	// ++ Галфинд_Домнышева_30_06_2022

	ТипГруппаФормы = Тип("ГруппаФормы");
	ТипПолеФормы = Тип("ПолеФормы");
		
	НовыйЭлемент = Элементы.Добавить("гф_ГруппаНаименованиеКод", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.Ширина = 0;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = Элементы.Вставить("Код", ТипПолеФормы, Элементы.гф_ГруппаНаименованиеКод);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Код";
	
	Элементы.Переместить(Элементы.Наименование, Элементы.гф_ГруппаНаименованиеКод, 
						Элементы.Код);
	
    НовыйЭлемент = Элементы.Добавить("гф_НомерГодЛимит", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь; 
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
	НовыйЭлемент = Элементы.Вставить("гф_Номер", ТипПолеФормы, Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Номер";
	
	НовыйЭлемент = Элементы.Вставить("гф_Год", ТипПолеФормы, Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_Год";
	
	НовыйЭлемент = Элементы.Вставить("гф_ТехническийЛимит", ТипПолеФормы,
	               Элементы.гф_НомерГодЛимит);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ТехническийЛимит";   
	
	НовыйЭлемент = Элементы.Добавить("гф_ГруппаФормированиеЗаказов", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = Истина;
	НовыйЭлемент.Заголовок = "Формирование заказов";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = Элементы.Вставить("гф_ДатаНачалаФормированияЗаказов", ТипПолеФормы,
				Элементы.гф_ГруппаФормированиеЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаФормированияЗаказов";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияФормированияЗаказов", ТипПолеФормы,
				Элементы.гф_ГруппаФормированиеЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияФормированияЗаказов"; 
	
	НовыйЭлемент = Элементы.Добавить("гф_ГруппаОтгрузкиЗаказов", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	НовыйЭлемент.ОтображатьЗаголовок = Истина;
	НовыйЭлемент.Заголовок = "Отгрузка заказов";
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
		
	НовыйЭлемент = Элементы.Вставить("гф_ДатаНачалаОтгрузкиЗаказов", ТипПолеФормы,
					Элементы.гф_ГруппаОтгрузкиЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаНачалаОтгрузкиЗаказов";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияОтгрузкиЗаказов", ТипПолеФормы,
					Элементы.гф_ГруппаОтгрузкиЗаказов);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияОтгрузкиЗаказов"; 
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаОкончанияРедактированияСкидок", ТипПолеФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаОкончанияРедактированияСкидок";
	
	НовыйЭлемент = Элементы.Вставить("гф_ДатаИзготовления", ТипПолеФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ДатаИзготовления";

	НовыйЭлемент = Элементы.Добавить("гф_ГруппаЕРП", ТипГруппаФормы);
	НовыйЭлемент.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НовыйЭлемент.Отображение = ОтображениеОбычнойГруппы.Нет;
	НовыйЭлемент.ОтображатьЗаголовок = Ложь;
	НовыйЭлемент.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НовыйЭлемент.РастягиватьПоГоризонтали = Неопределено;
	
	Элементы.Переместить(Элементы.Родитель, Элементы.гф_ГруппаЕРП); 
	Элементы.Переместить(Элементы.ГруппаДатаНачалаОкончания, Элементы.гф_ГруппаЕРП, 
						Элементы.Родитель);
	Элементы.Переместить(Элементы.ГруппаУправлениеКоллекцией, Элементы.гф_ГруппаЕРП, 
						Элементы.ГруппаДатаНачалаОкончания);
	// -- Галфинд_Домнышева_30_06_2022
	// ++ Галфинд СадомцевСА 14.03.2023 Добавил поле "Применять бонусы" на форму
	//e1cib/data/Задача.ЗадачаИсполнителя?ref=812ebcee7bda45d711edbe4fb7595601
	НовыйЭлемент = Элементы.Вставить("гф_ПрименятьБонусы", ТипПолеФормы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.гф_ПрименятьБонусы";
	// -- Галфинд СадомцевСА 14.03.2023

КонецПроцедуры

#КонецОбласти
